---
kind: method
id: M:Autodesk.Revit.DB.RevisionNumberingSequence.GetAlphanumericRevisionSettings
source: html/46b8cc2b-f31d-f4e3-e140-7b05ce50730c.htm
---
# Autodesk.Revit.DB.RevisionNumberingSequence.GetAlphanumericRevisionSettings Method

Returns a copy of the AlphanumericRevisionSettings owned by this revision numbering sequence.

## Syntax (C#)
```csharp
public AlphanumericRevisionSettings GetAlphanumericRevisionSettings()
```

## Returns
The copy of the AlphaumericRevisionSettings owned by this revision numbering sequence.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This RevisionNumberingSequence doesn't own a valid alphanumeric revision settings.